In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [10]:
df

     A      B         C         D
0  foo    one -0.386075 -0.564325
1  bar    one  0.225852  0.821448
2  foo    two -0.504630 -0.441138
3  bar  three  0.873468  0.520775
4  foo    two  1.116669  0.522691
5  bar    two -0.121311 -0.329017
6  foo    one  0.151138  0.486253
7  foo  three -0.439191 -0.925756

In [11]:
grouped = df.groupby('A')

In [12]:
grouped

In [13]:
df2 = df.set_index(['A', 'B'])

In [14]:
df

     A      B         C         D
0  foo    one -0.386075 -0.564325
1  bar    one  0.225852  0.821448
2  foo    two -0.504630 -0.441138
3  bar  three  0.873468  0.520775
4  foo    two  1.116669  0.522691
5  bar    two -0.121311 -0.329017
6  foo    one  0.151138  0.486253
7  foo  three -0.439191 -0.925756

In [18]:
df2.index

MultiIndex(levels=[['bar', 'foo'], ['one', 'three', 'two']],
           codes=[[1, 0, 1, 0, 1, 0, 1, 1], [0, 0, 2, 1, 2, 2, 0, 1]],
           names=['A', 'B'])

In [17]:
df2.index.names

FrozenList(['A', 'B'])

In [15]:
df2.index.names.difference(['B'])

FrozenList(['A'])

In [19]:
df2.index.names.difference(['A'])

FrozenList(['B'])

In [20]:
df2.index.names.difference(['A','B'])

FrozenList([])

In [21]:
grouped.sum()

            C         D
A
bar  0.978009  1.013206
foo -0.062088 -0.922275

In [29]:
df2 = pd.DataFrame({'X': ['B', 'B', 'A', 'A'], 'Y': [1, 2, 3, 4]})

In [30]:
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [33]:
df2.groupby(['X']).size()

X
A    2
B    2
dtype: int64

In [34]:
df2.groupby(['X']).sum()

   Y
X
A  7
B  3

In [37]:
df = pd.DataFrame({"User": ["user1", "user2", "user2", "user3", "user2", "user1", "user3"],
                  "Amount": [10.0, 5.0, 8.0, 10.5, 7.5, 8.0, 9],
                  'Score': [9, 1, 8, 7, 7, 6, 9]})

In [38]:
def my_agg(x):
    names = {
        'Amount mean': x['Amount'].mean(),
        'Amount std':  x['Amount'].std(),
        'Amount range': x['Amount'].max() - x['Amount'].min(),
        'Score Max':  x['Score'].max(),
        'Score Sum': x['Score'].sum(),
        'Amount Score Sum': (x['Amount'] * x['Score']).sum()}

    return pd.Series(names, index=['Amount range', 'Amount std', 'Amount mean',
                                   'Score Sum', 'Score Max', 'Amount Score Sum'])

In [39]:
df.groupby('User').apply(my_agg)

/usr/local/lib/python3.5/dist-packages/pandas/core/computation/check.py:19: UserWarning: The installed version of numexpr 2.4.3 is not supported in pandas and will be not be used
The minimum supported version is 2.6.1

  ver=ver, min_ver=_MIN_NUMEXPR_VERSION), UserWarning)

,Amount range,Amount std,Amount mean,Score Sum,Score Max,Amount Score Sum
User,,,,,,
user1,2.0,1.414214,9.000000,15.0,9.0,138.0
user2,3.0,1.607275,6.833333,16.0,8.0,121.5
user3,1.5,1.060660,9.750000,16.0,9.0,154.5

In [40]:
df = pd.DataFrame({"User": ["user1", "user2", "user2", "user3", "user2", "user1"],
              "Amount": [10.0, 5.0, 8.0, 10.5, 7.5, 8.0],
              'Other': [1,2,3,4,5,6]})

df.groupby('User').agg({'Amount' : ['sum', 'count'], 'Other':['max', 'std']})

      Amount       Other
         sum count   max       std
User
user1   18.0     2     6  3.535534
user2   20.5     3     5  1.527525
user3   10.5     1     4       NaN